/**
 ******************************************************************************
 * @file    alg_temperature.c
 * @author  Jason
 * @version V1.0.0
 * @date    2016-11-5
 * @brief   The arithmetic of temperature
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "alg_temperature.h"


/* private variables declare */
static float alg_coreTemperature_param1 = 0.0f;
static float alg_coreTemperature_param2 = 0.0f;
static float alg_coreTemperature_param3 = 0.0f;
static float alg_coreTemperature_param4 = 0.0f;
static float alg_coreTemperature_param5 = 0.0f;

const float Rt_ref_2K[NTC_LUT_LEN] = 
{
	2252,2243,2234,2225,2216,2206,2196,2186,2176,2166, //25.0~25.9
	2156,2147,2138,2129,2120,2111,2102,2093,2084,2075, //26.0~26.9
	2064,2055,2046,2037,2028,2019,2010,2001,1992,1983, //27.0~27.9
	1977,1968,1959,1950,1942,1934,1926,1918,1910,1902, //28.0~28.9
	1894,1886,1878,1870,1862,1854,1846,1838,1830,1822, //29.0~29.9
	1815,1808,1800,1793,1785,1777,1770,1762,1755,1747, //30.0~30.9
	1739,1732,1725,1717,1710,1703,1696,1689,1682,1675, //31.0~31.9
	1667,1660,1653,1646,1640,1633,1626,1619,1612,1606, //32.0~32.9
	1599,1592,1586,1579,1573,1566,1560,1553,1547,1540, //33.0~33.9
	1533,1528,1522,1515,1509,1503,1497,1490,1484,1478, //34.0~34.9
	1471,1466,1460,1454,1448,1442,1436,1430,1424,1418, //35.0~35.9
	1412,1407,1401,1395,1390,1384,1378,1372,1367,1361, //36.0~36.9
	1355,1350,1344,1339,1333,1328,1322,1317,1311,1306, //37.0~37.9
	1301,1296,1290,1285,1280,1274,1269,1264,1258,1253, //38.0~38.9
	1249,1244,1239,1234,1228,1223,1218,1213,1208,1203, //39.0~39.9
	1200,1195,1190,1185,1180,1175,1170,1166,1161,1156, //40.0~40.9 
};

const float Rt_ref_10K[NTC_LUT_LEN] = 
{
   //深圳栋邦阻温表A.10K3980B-161221（0.1分度）
    10000.0,9956.1,	9912.4,	9869.0,	9825.8,	9782.8,	9740.0,	9697.4,	9655.0,	9612.9, //25.0~25.9
    9570.9,	9529.2,	9487.6,	9446.3,	9405.2,	9364.3,	9323.6,	9283.1,	9242.8,	9202.7,	//26.0~26.9
    9162.8,	9123.0,	9083.5,	9044.2,	9005.1,	8966.2,	8927.4,	8888.9,	8850.5,	8812.4,	//27.0~27.9
    8774.4,	8736.6,	8699.0,	8661.6,	8624.4,	8587.3,	8550.5,	8513.8,	8477.3,	8440.9,	//28.0~28.9
    8404.8,	8368.8,	8333.0,	8297.4,	8262.0,	8226.7,	8191.6,	8156.7,	8121.9,	8087.3,	//29.0~29.9
    8052.9,	8018.7,	7984.6,	7950.7,	7916.9,	7883.3,	7849.9,	7816.7,	7783.6,	7750.6,	//30.0~30.9
    7717.8,	7685.2,	7652.8,	7620.5,	7588.3,	7556.3,	7524.5,	7492.8,	7461.3,	7429.9,	//31.0~31.9
    7398.6,	7367.6,	7336.6,	7305.9,	7275.2,	7244.7,	7214.4,	7184.2,	7154.2,	7124.3,	//32.0~32.9
    7094.5,	7064.9,	7035.4,	7006.1,	6976.9,	6947.8,	6918.9,	6890.1,	6861.5,	6833.0,	//33.0~33.9
    6804.6,	6776.4,	6748.3,	6720.3,	6692.5,	6664.8,	6637.2,	6609.8,	6582.5,	6555.3,	//34.0~34.9
    6528.3,	6501.4,	6474.6,	6447.9,	6421.4,	6395.0,	6368.7,	6342.5,	6316.5,	6290.5,	//35.0~35.9
    6264.7,	6239.1,	6213.5,	6188.1,	6162.8,	6137.6,	6112.5,	6087.5,	6062.7,	6038.0,	//36.0~36.9
    6013.4,	5988.9,	5964.5,	5940.2,	5916.1,	5892.0,	5868.1,	5844.3,	5820.6,	5797.0,	//37.0~37.9
    5773.5,	5750.1,	5726.9,	5703.7,	5680.6,	5657.7,	5634.9,	5612.1,	5589.5,	5567.0,	//38.0~38.9
    5544.6,	5522.3,	5500.1,	5478.0,	5455.9,	5434.0,	5412.2,	5390.5,	5368.9,	5347.4,	//39.0~39.9
    5326.0,	5304.7,	5283.5,	5262.4,	5241.4,	5220.5,	5199.7,	5179.0,	5158.3,	5137.8, //40.0~40.9   
};

const float Tempurature[NTC_LUT_LEN] =
{
	25, 25.1, 25.2, 25.3, 25.4, 25.5, 25.6, 25.7, 25.8, 25.9,
	26, 26.1, 26.2, 26.3, 26.4,	26.5, 26.6,	26.7, 26.8,	26.9,
	27, 27.1, 27.2,	27.3, 27.4,	27.5, 27.6,	27.7, 27.8,	27.9,
	29,	29.1, 29.2,	29.3, 29.4,	29.5, 29.6,	29.7, 29.8,	29.9,
	28,	28.1, 28.2,	28.3, 28.4,	28.5, 28.6,	28.7, 28.8,	28.9,
	30,	30.1, 30.2,	30.3, 30.4,	30.5, 30.6,	30.7, 30.8,	30.9,
	31,	31.1, 31.2,	31.3, 31.4,	31.5, 31.6,	31.7, 31.8,	31.9,
	32,	32.1, 32.2,	32.3, 32.4,	32.5, 32.6,	32.7, 32.8,	32.9,
	33,	33.1, 33.2,	33.3, 33.4,	33.5, 33.6,	33.7, 33.8,	33.9,
	34,	34.1, 34.2,	34.3, 34.4,	34.5, 34.6,	34.7, 34.8,	34.9,
	35,	35.1, 35.2,	35.3, 35.4,	35.5, 35.6,	35.7, 35.8,	35.9,
	36,	36.1, 36.2,	36.3, 36.4,	36.5, 36.6,	36.7, 36.8,	36.9,
	37,	37.1, 37.2,	37.3, 37.4, 37.5, 37.6,	37.7, 37.8,	37.9,
	38,	38.1, 38.2,	38.3, 38.4,	38.5, 38.6,	38.7, 38.8,	38.9,
	39,	39.1, 39.2,	39.3, 39.4,	39.5, 39.6,	39.7, 39.8,	39.9,
	40,	40.1, 40.2,	40.3, 40.4,	40.5, 40.6,	40.7, 40.8,	40.9,
};

/* function declare */

/**
  * @brief  ntc_temperature_calculate
  * @note   通过NTC电阻值计算对应温度值
  * @param[in]  Rt
  * @param[out] *tVal
  * @param[in] 
  * @retval None    
  */
void ntc_temperature_calculate(uint32_t Rt,float *tVal,NTC_TYPE_T ntctype)
{
	uint16_t 	num=0;
	float 		Tamb=0;
	float 		Mid=0;
	   
    switch(ntctype)
    {
        case NTC_2K:
        {
            for(num=0;num<NTC_LUT_LEN;num++)
            {
                if(Rt >= Rt_ref_2K[num])
				{
					break;
				}
            }
        }
        break;
        case NTC_10K:
        {
            for(num=0;num<NTC_LUT_LEN;num++)
            {
                if(Rt >= Rt_ref_10K[num])
				{
					break;
				}
            }        
        }
        break;
        default:break;
    }    
	
	if(num >= NTC_LUT_LEN - 1)
	{
		Tamb = Tempurature[NTC_LUT_LEN - 1];
	}
	else if(num == 0)
	{
		Tamb = Tempurature[0];
	}
	else
	{
		switch(ntctype)
		{
			case NTC_2K:
			{
				Mid = (Rt_ref_2K[num] - Rt_ref_2K[num-1])/2;
				if((Rt-Rt_ref_2K[num]) <= Mid)
				{
					Tamb = Tempurature[num-1];
				}
				else
				{
					Tamb = Tempurature[num];
				}
			}
			break;
			case NTC_10K:
			{
				Mid = (Rt_ref_10K[num] - Rt_ref_10K[num-1])/2;
				if((Rt-Rt_ref_10K[num]) <= Mid)
				{
					Tamb = Tempurature[num-1];
				}
				else
				{
					Tamb = Tempurature[num];
				}
			}
			break;
			default:break;
		}
	}
	*tVal = Tamb;	
}
/**
  * @brief  alg_core_temperature_calculate_init
  * @note   核心温度算法初始化：将核心温度计算公式化简之后使用的参数计算
  * @param  None
  * @retval None    
  */
void alg_core_temperature_calculate_init(void)
{
	alg_coreTemperature_param1 = (float)(Ks / Kg);
	alg_coreTemperature_param2 = (float)((Kiso*Aiso_m)/(Kg*As));
	alg_coreTemperature_param3 = (float)(alg_coreTemperature_param2*alpha/(alpha+Kiso));
	alg_coreTemperature_param4 = (float)(alg_coreTemperature_param2*Ks/(alpha+Kiso));
	alg_coreTemperature_param5 = (float)(alg_coreTemperature_param2*Kiso/(2*(alpha+Kiso)));
}

/**
  * @brief  core_temperature_calculate
  * @note   通过TH1、TH2计算core temperature
*/	/***********************  core temperature calculate formula ************************************************/
	/*                                                                                                          */
	/*				 Ks				  Kiso Aiso_m	TH1+TH2		aTH2 - Ks(TH1-TH2) + Kiso((TH1+TH2)/2)          */
	/* Tcore = TH1 + --*(TH1 - TH2) + ----*------*(--------- - --------------------------------------- )        */
	/*               Kg                Kg    As        2                       a + Kiso                         */ 
	/*                                                                                                          */
	/************************************************************************************************************ 	
  * @param[in]  Th1,Th2
  * @param[out] *coreTem
  * @retval None    
  */
void core_temperature_calculate(float Th1,float Th2, float *coreTem)
{
	if(Th1 >= Th2)
	{
		*coreTem = Th1 + alg_coreTemperature_param1*(Th1-Th2) + alg_coreTemperature_param2*(Th1+Th2)/2 \
					   - alg_coreTemperature_param3*Th2 + alg_coreTemperature_param4*(Th1-Th2) \
					   - alg_coreTemperature_param5*(Th1+Th2);
	}
	else //采集错误
	{
		*coreTem = 0;
	}
}



/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

